a = [1]
b = [2, 3]
a.concat(b) #=> [1, 2, 3]

a = [1]
b = [2, 3]
a + b #=> [1, 2, 3]

a = [1, 2, 3]
b = [3, 4, 5]
a | b #=> [1, 2, 3, 4, 5]

a = [1, 2, 3]
b = [3, 4, 5]
a - b #=> [1, 2]

a = [1, 2, 3]
b = [3, 4, 5]
a & b #=>[3]

require 'set'
a = Set.new([1, 2, 3])
b = Set.new([3, 4, 5])
a | b #=> #<Set: {1, 2, 3, 4, 5}>
a - b #=> #<Set: {1, 2}>
a & b #=> #<Set: {3}>

e, *f = 100, 200, 300
e #=> 100
f #=> [200, 300]

a = []
b = [2, 3]
a.push(1) #=> [1,]
a.push(*b) #=> [1, 2, 3]

def greeting(*names)
  "#{names.join('と')}、こんにちは！"
end
greeting('田中さん') #=> "田中さん、こんにちは！"
greeting('田中さん', 'スズキさん') #=> "田中さんとスズキさん、こんにちは！"


a = [1, 2, 3]
[-1, 0, *a, 4, 5] #=> [-1, 0, 1, 2, 3, 4, 5]
[-1, 0] + a + [4, 5] #=> [-1, 0, 1, 2, 3, 4, 5]
